---
kind: property
id: P:Autodesk.Revit.DB.MEPCurveType.RoutingPreferenceManager
source: html/9fd171c5-b908-07d0-6fdc-bbcdcfae35a4.htm
---
# Autodesk.Revit.DB.MEPCurveType.RoutingPreferenceManager Property

The RoutingPreferenceManager for the MEPCurveType

## Syntax (C#)
```csharp
public RoutingPreferenceManager RoutingPreferenceManager { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.